SoyVitouPro/ESP32-V2/src/main.cpp
// ESP32 HUB75 + WebServer pipeline:
// - Browser renders Khmer text (proper shaping) to Canvas
// - Canvas is cropped and converted to RGB565 in JS
// - Browser uploads RGB565 blob to ESP32
// - ESP32 displays the uploaded bitmap on the HUB75 panel

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <FS.h>
#include <LittleFS.h>
#include <ESP32-VirtualMatrixPanel-I2S-DMA.h>
#include <string.h>
#include <vector>

// Panel configuration (defaults). Adjust via UI if needed.
#ifndef PANEL_RES_X
#define PANEL_RES_X 128
#endif
#ifndef PANEL_RES_Y
#define PANEL_RES_Y 64
#endif
#ifndef NUM_ROWS
#define NUM_ROWS 1
#endif
#ifndef NUM_COLS
#define NUM_COLS 1
#endif
#define PANEL_CHAIN (NUM_ROWS * NUM_COLS)

// Runtime layout (allows switching panel configurations without recompiling)
static int cur_rows = NUM_ROWS;   // current layout rows
static int cur_cols = NUM_COLS;   // current layout cols
static inline int VIRT_W() { return cur_cols * PANEL_RES_X; }
static inline int VIRT_H() { return cur_rows * PANEL_RES_Y; }

// Panel chain orientation mapping (do not define macros with same names as enum constants)
// Legacy workflow used numeric defines like 0x02; with the current library use enum values.
// To mirror/reverse horizontally as per your request to switch from 0x02 to 0x01,
// set VIRTUAL_MATRIX_CHAIN_TYPE to CHAIN_BOTTOM_RIGHT_UP instead of CHAIN_BOTTOM_LEFT_UP.
#define VIRTUAL_MATRIX_CHAIN_TYPE CHAIN_BOTTOM_RIGHT_UP

// GPIO mapping

// Define GPIO Pins for ESP32-S3-WROOM-1
#define R1_PIN 4
#define G1_PIN 5
#define B1_PIN 6
#define R2_PIN 7
#define G2_PIN 15
#define B2_PIN 16
#define A_PIN 17
#define B_PIN 18
#define C_PIN 8
#define D_PIN 3
#define E_PIN 46
#define LAT_PIN 9
#define OE_PIN 10
#define CLK_PIN 11

MatrixPanel_I2S_DMA *dma_display = nullptr;
VirtualMatrixPanel  *vdisplay = nullptr;

// Wi-Fi SoftAP config
static const char* AP_SSID = "KHMER_PANEL";
static const char* AP_PASS = "12345678"; // 8+ chars required

WebServer server(80);

// CORS headers for cross-origin requests
void sendCORSHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

// Uploaded text bitmap (RGB565), text-only cropped image
static std::vector<uint8_t> uploadBuf;      // raw bytes as received (header + pixels)
static std::vector<uint16_t> textPixels;    // pixels only, RGB565
static std::vector<uint8_t>  textAlpha;     // optional A8 alpha per pixel
static std::vector<uint16_t> frameBuffer;   // full virtual offscreen RGB565
static std::vector<uint16_t> bgPixels;      // optional background image (virtual-sized)
static bool hasBgImage = false;
static uint16_t imgW = 0, imgH = 0;         // text image size
// Panel config (for multi-panel awareness)
static int g_panel_rows = NUM_ROWS; // hardware default rows
static int g_panel_cols = NUM_COLS; // hardware default cols
static String g_panel_map; // optional: comma-separated indices/names from UI
static std::vector<uint8_t> g_panel_active; // 1=enabled, 0=disabled per physical panel index

// Render settings from client
static uint16_t bgColor = 0x0000;           // RGB565 background
static int16_t userOffX = 0;                // base X offset
static int16_t userOffY = 0;                // base Y offset
static bool animate = false;                // scroll enable
static int8_t animDir = -1;                 // -1 = left, +1 = right
static uint16_t animSpeedMs = 30;           // delay between frames (10..60)
static int16_t  loopOffsetPx = 0;           // loop overlap/gap in pixels: <0 overlap, >0 gap

// Animation state
static int16_t scrollX = 0;                 // current scroll position (left of text)
static int16_t baseY = 0;                   // vertically centered baseline + userOffY
static uint32_t lastAnim = 0;
static uint32_t restartAt = 0;              // time to restart next cycle
static bool waitingRestart = false;
static std::vector<int16_t> heads;         // multi-head array for continuous text stream

// Display mode tracking
enum DisplayMode { MODE_NONE, MODE_CLOCK, MODE_THEME };
static DisplayMode currentMode = MODE_NONE;

// Panel helpers
static inline int panelIndexFromXY(int x, int y) {
  int col = x / PANEL_RES_X;
  int row = y / PANEL_RES_Y;
  return row * cur_cols + col; // row-major for current layout
}

static void maskDisabledPanels() {
  if (g_panel_active.empty()) return;
  for (int row = 0; row < g_panel_rows; ++row) {
    for (int col = 0; col < g_panel_cols; ++col) {
      int idx = row * g_panel_cols + col;
      if (idx < (int)g_panel_active.size() && g_panel_active[idx] == 0) {
        int x0 = col * PANEL_RES_X;
        int y0 = row * PANEL_RES_Y;
        for (int y = 0; y < PANEL_RES_Y; ++y) {
          size_t base = (size_t)(y0 + y) * (size_t)VIRT_W() + (size_t)x0;
          for (int x = 0; x < PANEL_RES_X; ++x) {
            frameBuffer[base + (size_t)x] = 0x0000; // force black on disabled panel
          }
        }
      }
    }
  }
}

static const char* panelLabelForIndex(int idx) {
  static const char* labels[] = {"main","second","third","fourth","fifth","sixth","seventh","eighth"};
  int n = sizeof(labels)/sizeof(labels[0]);
  if (idx >= 0 && idx < n) return labels[idx];
  return "panel";
}

static int indexFromToken(const String& tok) {
  String t = tok; t.toLowerCase(); t.trim();
  if (t.length() == 0) return -1;
  if (t == "main") return 0;
  if (t == "second") return 1;
  if (t == "third") return 2;
  if (t == "fourth") return 3;
  if (t == "fifth") return 4;
  if (t == "sixth") return 5;
  if (t == "seventh") return 6;
  if (t == "eighth") return 7;
  // also accept numeric (1-based or 0-based)
  bool allDigits = true; for (size_t i=0;i<t.length();++i){ if (!isDigit((int)t[i])) { allDigits=false; break; } }
  if (allDigits) {
    int v = t.toInt();
    if (v >= 1) v -= 1; // treat as 1-based index
    return v;
  }
  return -1;
}

// Serve a file from LittleFS
static String contentTypeFor(const String& path) {
  if (path.endsWith(".html")) return "text/html; charset=utf-8";
  if (path.endsWith(".css")) return "text/css";
  if (path.endsWith(".js")) return "application/javascript";
  if (path.endsWith(".png")) return "image/png";
  if (path.endsWith(".ico")) return "image/x-icon";
  return "text/plain";
}

static const char FALLBACK_HTML[] PROGMEM = R"HTML(
<!doctype html><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>IHUB75</title>
<body style="font-family:system-ui,Arial,sans-serif;padding:16px;line-height:1.5;background:#0b0f14;color:#e7eef7">
<h2 style="margin:0 0 12px">IHUB75</h2>
<p>index.html not found on LittleFS.</p>
<p>Upload it with PlatformIO:</p>
<pre style="background:#121820;padding:12px;border-radius:8px;border:1px solid #1f2a35">pio run -t uploadfs</pre>
<p>Then refresh this page.</p>
</body>
)HTML";

void handleRoot() {
  sendCORSHeaders();
  File f = LittleFS.open("/index.html", "r");
  if (!f) {
    server.send_P(200, "text/html; charset=utf-8", FALLBACK_HTML);
    return;
  }
  server.streamFile(f, contentTypeFor("/index.html"));
  f.close();
}

// Generic file handler for CSS, JS, images, etc.
void handleStaticFile() {
  sendCORSHeaders();
  String path = server.uri();
  if (path == "/") {
    path = "/index.html";
  }

  File f = LittleFS.open(path, "r");
  if (!f) {
    server.send(404, "text/plain", "File not found");
    return;
  }

